{
    "AccountsPayable": "Carrying value as of the balance sheet date of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business. For classified balance sheets, used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer); for unclassified balance sheets, used to reflect the total liabilities (regardless of due date).",
    "AccountsPayableCurrent": "Carrying value as of the balance sheet date of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer).",
    "AccountsReceivableNetCurrent": "Amount, after allowance for credit loss, of right to consideration from customer for product sold and service rendered in normal course of business, classified as current.",
    "AccruedIncomeTaxesCurrent": "Carrying amount as of the balance sheet date of the unpaid sum of the known and estimated amounts payable to satisfy all currently due domestic and foreign income tax obligations.",
    "AccruedIncomeTaxesNoncurrent": "Carrying amount as of the balance sheet date of the unpaid sum of the known and estimated amounts payable to satisfy all domestic and foreign income tax obligations due beyond one year or the operating cycle, whichever is longer. Alternate captions include income taxes payable, noncurrent.",
    "AccruedLiabilities": "Carrying value as of the balance sheet date of obligations incurred and payable, pertaining to costs that are statutory in nature, are incurred on contractual obligations, or accumulate over time and for which invoices have not yet been received or will not be rendered. Examples include taxes, interest, rent and utilities. For classified balance sheets, used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer); for unclassified balance sheets, used to reflect the total liabilities (regardless of due date).",
    "AccruedLiabilitiesCurrent": "Carrying value as of the balance sheet date of obligations incurred and payable, pertaining to costs that are statutory in nature, are incurred on contractual obligations, or accumulate over time and for which invoices have not yet been received or will not be rendered. Examples include taxes, interest, rent and utilities. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer).",
    "AccruedMarketingCostsCurrent": "Carrying value as of the balance sheet date of obligations incurred through that date and payable for the marketing, trade and selling of the entity's goods and services. Marketing costs would include expenditures for planning and executing the conception, pricing, promotion, and distribution of ideas, goods, and services; costs of public relations and corporate promotions; and obligations incurred and payable for sales discounts, rebates, price protection programs, etc. offered to customers and under government programs. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer).",
    "AccumulatedDepreciationDepletionAndAmortizationPropertyPlantAndEquipment": "Amount of accumulated depreciation, depletion and amortization for physical assets used in the normal conduct of business to produce goods and services.",
    "AccumulatedOtherComprehensiveIncomeLossAvailableForSaleSecuritiesAdjustmentNetOfTax": "Amount, after tax, of accumulated unrealized gain (loss) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale).",
    "AccumulatedOtherComprehensiveIncomeLossCumulativeChangesInNetGainLossFromCashFlowHedgesEffectNetOfTax": "Accumulated change, net of tax, in accumulated gains and losses from derivative instruments designated and qualifying as the effective portion of cash flow hedges. Includes an entity's share of an equity investee's Increase or Decrease in deferred hedging gains or losses.",
    "AccumulatedOtherComprehensiveIncomeLossForeignCurrencyTranslationAdjustmentNetOfTax": "Accumulated adjustment, net of tax, that results from the process of translating subsidiary financial statements and foreign equity investments into the reporting currency from the functional currency of the reporting entity, net of reclassification of realized foreign currency translation gains or losses.",
    "AccumulatedOtherComprehensiveIncomeLossNetOfTax": "Accumulated change in equity from transactions and other events and circumstances from non-owner sources, net of tax effect, at period end. Excludes Net Income (Loss), and accumulated changes in equity from transactions resulting from investments by owners and distributions to owners. Includes foreign currency translation items, certain pension adjustments, unrealized gains and losses on certain investments in debt and equity securities, other than temporary impairment (OTTI) losses related to factors other than credit losses on available-for-sale and held-to-maturity debt securities that an entity does not intend to sell and it is not more likely than not that the entity will be required to sell before recovery of the amortized cost basis, as well as changes in the fair value of derivatives related to the effective portion of a designated cash flow hedge.",
    "AdjustmentsToAdditionalPaidInCapitalSharebasedCompensationRequisiteServicePeriodRecognitionValue": "Amount of increase to additional paid-in capital (APIC) for recognition of cost for award under share-based payment arrangement.",
    "AdjustmentsToAdditionalPaidInCapitalTaxEffectFromShareBasedCompensation": "Amount of increase in additional paid in capital (APIC) resulting from a tax benefit associated with share-based compensation plan other than an employee stock ownership plan (ESOP). Includes, but is not limited to, excess tax benefit.",
    "AdvertisingExpense": "Amount charged to advertising expense for the period, which are expenses incurred with the objective of increasing revenue for a specified brand, product or product line.",
    "AllocatedShareBasedCompensationExpense": "Amount of expense for award under share-based payment arrangement. Excludes amount capitalized.",
    "AllowanceForDoubtfulAccountsReceivableCurrent": "Amount of allowance for credit loss on accounts receivable, classified as current.",
    "AmortizationOfIntangibleAssets": "The aggregate expense charged against earnings to allocate the cost of intangible assets (nonphysical assets not used in production) in a systematic and rational manner to the periods expected to benefit from such assets. As a noncash expense, this element is added back to net income when calculating cash provided by or used in operations using the indirect method.",
    "AntidilutiveSecuritiesExcludedFromComputationOfEarningsPerShareAmount": "Securities (including those issuable pursuant to contingent stock agreements) that could potentially dilute basic earnings per share (EPS) or earnings per unit (EPU) in the future that were not included in the computation of diluted EPS or EPU because to do so would increase EPS or EPU amounts or decrease loss per share or unit amounts for the period presented.",
    "Assets": "Sum of the carrying amounts as of the balance sheet date of all assets that are recognized. Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events.",
    "AssetsCurrent": "Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold, or consumed within one year (or the normal operating cycle, if longer). Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events.",
    "AssetsNoncurrent": "Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold or consumed after one year or beyond the normal operating cycle, if longer.",
    "AvailableForSaleDebtSecuritiesAccumulatedGrossUnrealizedGainBeforeTax": "Amount, before tax, of unrealized gain in accumulated other comprehensive income (AOCI) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale).",
    "AvailableForSaleDebtSecuritiesAccumulatedGrossUnrealizedLossBeforeTax": "Amount, before tax, of unrealized loss in accumulated other comprehensive income (AOCI) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale).",
    "AvailableForSaleDebtSecuritiesAmortizedCostBasis": "Amortized cost of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale).",
    "AvailableForSaleSecurities": "Amount of investment in debt and equity securities categorized neither as held-to-maturity nor trading.",
    "AvailableForSaleSecuritiesAccumulatedGrossUnrealizedGainBeforeTax": "Amount before tax of unrealized gain in accumulated other comprehensive income (AOCI) on investments in debt and equity securities classified as available-for-sale.",
    "AvailableForSaleSecuritiesAccumulatedGrossUnrealizedLossBeforeTax": "Amount before tax of unrealized loss in accumulated other comprehensive income (AOCI) on investments in debt and equity securities classified as available-for-sale.",
    "AvailableForSaleSecuritiesAmortizedCost": "This item represents the cost of debt and equity securities, which are categorized neither as held-to-maturity nor trading, net of adjustments including accretion, amortization, collection of cash, previous other-than-temporary impairments recognized in earnings (less any cumulative-effect adjustments recognized, as defined), and fair value hedge accounting adjustments, if any.",
    "AvailableForSaleSecuritiesContinuousUnrealizedLossPosition12MonthsOrLongerAccumulatedLoss": "Amount of accumulated unrealized loss on investments in debt and equity securities classified as available-for-sale that have been in a continuous loss position for twelve months or longer.",
    "AvailableForSaleSecuritiesContinuousUnrealizedLossPositionAccumulatedLoss": "Amount of accumulated unrealized loss on investments in debt and equity securities classified as available-for-sale in a continuous loss position.",
    "AvailableForSaleSecuritiesContinuousUnrealizedLossPositionFairValue": "This item represents the aggregate fair value of investments in debt and equity securities in an unrealized loss position which are categorized neither as held-to-maturity nor trading securities.",
    "AvailableForSaleSecuritiesContinuousUnrealizedLossPositionLessThan12MonthsAccumulatedLoss": "Amount of accumulated unrealized loss on investments in debt and equity securities classified as available-for-sale that have been in a continuous loss position for less than twelve months.",
    "AvailableForSaleSecuritiesContinuousUnrealizedLossPositionLessThanTwelveMonthsFairValue": "This item represents the aggregate fair value of investments in debt and equity securities categorized neither as held-to-maturity nor trading securities that have been in a continuous unrealized loss position for less than twelve months.",
    "AvailableForSaleSecuritiesContinuousUnrealizedLossPositionTwelveMonthsOrLongerFairValue": "This item represents the aggregate fair value of investments in debt and equity securities categorized neither as held-to-maturity nor trading securities that have been in a continuous unrealized loss position for twelve months or longer.",
    "AvailableForSaleSecuritiesCurrent": "Amount of investment in debt and equity securities categorized neither as trading securities nor held-to-maturity securities and intended be sold or mature one year or operating cycle, if longer.",
    "AvailableForSaleSecuritiesDebtMaturitiesRollingAfterYearTenFairValue": "Fair value of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), with single maturity date and allocated without single maturity date, maturing after rolling tenth fiscal year following latest fiscal year. For interim and annual periods when interim period is reported on rolling approach, from latest statement of financial position date.",
    "AvailableForSaleSecuritiesDebtMaturitiesRollingYearSixThroughTenFairValue": "Fair value of investment in debt security, measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), with single maturity date and allocated without single maturity date, maturing in rolling sixth through tenth fiscal year following latest fiscal year. For interim and annual periods when interim period is reported on rolling approach, from latest statement of financial position date.",
    "AvailableForSaleSecuritiesDebtMaturitiesRollingYearTwoThroughFiveFairValue": "Fair value of investment in debt security, measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), with single maturity date and allocated without single maturity date, maturing in next rolling fiscal year through fifth year following latest fiscal year. For interim and annual periods when interim period is reported on rolling approach, from latest statement of financial position date.",
    "AvailableForSaleSecuritiesDebtMaturitiesSingleMaturityDate": "Fair value of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), with single maturity date and allocated without single maturity date.",
    "AvailableForSaleSecuritiesDebtSecurities": "Amount of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale).",
    "AvailableForSaleSecuritiesDebtSecuritiesCurrent": "Amount of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), classified as current.",
    "AvailableForSaleSecuritiesDebtSecuritiesNoncurrent": "Amount of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), classified as noncurrent.",
    "AvailableForSaleSecuritiesFairValueDisclosure": "This element represents the portion of the balance sheet assertion valued at fair value by the entity whether such amount is presented as a separate caption or as a parenthetical disclosure. Additionally, this element may be used in connection with the fair value disclosures required in the footnote disclosures to the financial statements. The element may be used in both the balance sheet and disclosure in the same submission. This item represents Available-for-sale Securities which consist of all investments in certain debt and equity securities neither classified as trading or held-to-maturity securities. A debt security represents a creditor relationship with an enterprise. Debt securities include, among other items, US Treasury securities, US government securities, municipal securities, corporate bonds, convertible debt, commercial paper, and all securitized debt instruments. An equity security represents an ownership interest in an enterprise or the right to acquire or dispose of an ownership interest in an enterprise at fixed or determinable prices. Equity securities include, among other things, common stock, certain preferred stock, warrant rights, call options, and put options, but do not include convertible debt. An entity may opt to provide the reader with additional narrative text to better understand the nature of investments in debt and equity securities which are categorized as Available-for-sale.",
    "AvailableForSaleSecuritiesGrossUnrealizedLosses1": "This item represents the gross unrealized losses for securities, at a point in time, which are categorized neither as held-to-maturity nor trading securities.",
    "AvailableForSaleSecuritiesNoncurrent": "Investments in debt and equity securities which are categorized neither as held-to-maturity nor trading and which are intended to be sold or mature more than one year from the balance sheet date or operating cycle, if longer. Such securities are reported at fair value; unrealized gains (losses) related to Available-for-sale Securities are excluded from earnings and reported in a separate component of shareholders' equity (other comprehensive income), unless the Available-for-sale security is designated as a hedge or is determined to have had an other than temporary decline in fair value below its amortized cost basis. All or a portion of the unrealized holding gain (loss) of an Available-for-sale security that is designated as being hedged in a fair value hedge is recognized in earnings during the period of the hedge, as are other than temporary declines in fair value below the cost basis for investments in equity securities and debt securities that an entity intends to sell or it is more likely than not that it will be required to sell before the recovery of its amortized cost basis. Other than temporary declines in fair value below the cost basis for debt securities categorized as Available-for-sale that an entity does not intend to sell and for which it is not more likely than not that the entity will be required to sell before the recovery of its amortized cost basis are bifurcated into credit losses and losses related to all other factors. Other than temporary declines in fair value below cost basis related to credit losses are recognized in earnings, and losses related to all other factors are recognized in other comprehensive income.",
    "AvailableforsaleSecuritiesGrossUnrealizedGain": "This item represents the gross unrealized gains for securities, at a point in time, which are categorized neither as held-to-maturity nor trading securities.",
    "BusinessAcquisitionCostOfAcquiredEntityPurchasePrice": "The total cost of the acquired entity including the cash paid to shareholders of acquired entities, fair value of debt and equity securities issued to shareholders of acquired entities, the fair value of the liabilities assumed, and direct costs of the acquisition.",
    "BusinessAcquisitionPurchasePriceAllocationAmortizableIntangibleAssets": "The amount of acquisition cost of a business combination allocated to an identifiable intangible asset that will be amortized.",
    "BusinessAcquisitionPurchasePriceAllocationGoodwillAmount": "Amount of goodwill arising from a business combination, which is the excess of the cost of the acquired entity over the amounts assigned to assets acquired and liabilities assumed.",
    "BusinessAcquisitionPurchasePriceAllocationLiabilitiesAssumed": "The amount of acquisition cost of a business combination allocated to liabilities assumed.",
    "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedIntangibleAssetsOtherThanGoodwill": "Amount of intangible assets, excluding goodwill, acquired at the acquisition date.",
    "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedLiabilities": "Amount of liabilities assumed at the acquisition date.",
    "CapitalExpendituresIncurredButNotYetPaid": "Future cash outflow to pay for purchases of fixed assets that have occurred.",
    "CapitalizedComputerSoftwareAdditions": "Additions made to capitalized computer software costs during the period.",
    "CapitalizedComputerSoftwareAmortization": "For each income statement presented, the amount charged to expense for amortization of capitalized computer software costs.",
    "Cash": "Amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Excludes cash and cash equivalents within disposal group and discontinued operation.",
    "CashAndCashEquivalentsAtCarryingValue": "Amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Excludes cash and cash equivalents within disposal group and discontinued operation.",
    "CashAndCashEquivalentsPeriodIncreaseDecrease": "Amount of increase (decrease) in cash and cash equivalents. Cash and cash equivalents are the amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Includes effect from exchange rate changes.",
    "CashCashEquivalentsRestrictedCashAndRestrictedCashEquivalents": "Amount of cash and cash equivalents, and cash and cash equivalents restricted to withdrawal or usage. Excludes amount for disposal group and discontinued operations. Cash includes, but is not limited to, currency on hand, demand deposits with banks or financial institutions, and other accounts with general characteristics of demand deposits. Cash equivalents include, but are not limited to, short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates.",
    "CashCashEquivalentsRestrictedCashAndRestrictedCashEquivalentsPeriodIncreaseDecreaseIncludingExchangeRateEffect": "Amount of increase (decrease) in cash, cash equivalents, and cash and cash equivalents restricted to withdrawal or usage; including effect from exchange rate change. Cash includes, but is not limited to, currency on hand, demand deposits with banks or financial institutions, and other accounts with general characteristics of demand deposits. Cash equivalents include, but are not limited to, short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates.",
    "CashEquivalentsAtCarryingValue": "Amount of short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Excludes cash and cash equivalents within disposal group and discontinued operation.",
    "ChangeInUnrealizedGainLossOnFairValueHedgingInstruments": "The amount recognized in earnings related to the change in fair value during the period of derivative or nonderivative instruments designated as fair value hedging instruments.",
    "CollateralAlreadyPostedAggregateFairValue": "The aggregate fair value of assets that are already posted, at the end of the reporting period, as collateral for derivative instruments with credit-risk-related contingent features.",
    "CommercialPaper": "Carrying value as of the balance sheet date of short-term borrowings using unsecured obligations issued by banks, corporations and other borrowers to investors. The maturities of these money market securities generally do not exceed 270 days.",
    "CommitmentsAndContingencies": "Represents the caption on the face of the balance sheet to indicate that the entity has entered into (1) purchase or supply arrangements that will require expending a portion of its resources to meet the terms thereof, and (2) is exposed to potential losses or, less frequently, gains, arising from (a) possible claims against a company's resources due to future performance under contract terms, and (b) possible losses or likely gains from uncertainties that will ultimately be resolved when one or more future events that are deemed likely to occur do occur or fail to occur.",
    "CommonStockDividendsPerShareCashPaid": "Aggregate dividends paid during the period for each share of common stock outstanding.",
    "CommonStockDividendsPerShareDeclared": "Aggregate dividends declared during the period for each share of common stock outstanding.",
    "CommonStockNoParValue": "Face amount per share of no-par value common stock.",
    "CommonStockParOrStatedValuePerShare": "Face amount or stated value per share of common stock.",
    "CommonStockSharesAuthorized": "The maximum number of common shares permitted to be issued by an entity's charter and bylaws.",
    "CommonStockSharesIssued": "Total number of common shares of an entity that have been sold or granted to shareholders (includes common shares that were issued, repurchased and remain in the treasury). These shares represent capital invested by the firm's shareholders and owners, and may be all or only a portion of the number of shares authorized. Shares issued include shares outstanding and shares held in the treasury.",
    "CommonStockSharesOutstanding": "Number of shares of common stock outstanding. Common stock represent the ownership interest in a corporation.",
    "CommonStocksIncludingAdditionalPaidInCapital": "Amount of par value plus amounts in excess of par value or issuance value for common stock issued.",
    "CommonStockValue": "Aggregate par or stated value of issued nonredeemable common stock (or common stock redeemable solely at the option of the issuer). This item includes treasury stock repurchased by the entity. Note: elements for number of nonredeemable common shares, par value and other disclosure concepts are in another section within stockholders' equity.",
    "ComprehensiveIncomeNetOfTax": "Amount after tax of increase (decrease) in equity from transactions and other events and circumstances from net income and other comprehensive income, attributable to parent entity. Excludes changes in equity resulting from investments by owners and distributions to owners.",
    "ContractWithCustomerLiability": "Amount of obligation to transfer good or service to customer for which consideration has been received or is receivable.",
    "ContractWithCustomerLiabilityCurrent": "Amount of obligation to transfer good or service to customer for which consideration has been received or is receivable, classified as current.",
    "ContractWithCustomerLiabilityRevenueRecognized": "Amount of revenue recognized that was previously included in balance of obligation to transfer good or service to customer for which consideration from customer has been received or is due.",
    "CostOfGoodsAndServicesSold": "The aggregate costs related to goods produced and sold and services rendered by an entity during the reporting period. This excludes costs incurred during the reporting period related to financial services rendered and other revenue generating activities.",
    "CostOfGoodsAndServicesSoldDepreciation": "Amount of expense for allocation of cost of tangible asset over its useful life directly used in production of good and rendering of service.",
    "CostOfReimbursableExpense": "Cost associated with reimbursable income. This occurs when a services entity incurs expenses on behalf of the client and passes through the cost of reimbursable expenses to a client.",
    "CumulativeEffectOfInitialAdoptionOfFIN48": "Cumulative net-of-tax effect of initial adoption of FIN 48 - Accounting for Uncertainty in Income Taxes on the opening balance of retained earnings. The cumulative-effect adjustment does not include items that would not be recognized in earnings, such as the effect of adopting this Interpretation on tax positions related to business combinations. The amount of that cumulative-effect adjustment is the difference between the net amount of assets and liabilities recognized in the statement of financial position prior to the application of this Interpretation and the net amount of assets and liabilities recognized as a result of applying the provisions of this Interpretation.",
    "CumulativeEffectOfInitialAdoptionOfNewAccountingPrinciple": "Cumulative effect of initial adoption of new accounting principle on beginning retained earnings, net of tax. This element can be used, generally, for the adjustment to retained earnings of a new accounting principle.",
    "CurrentFederalTaxExpenseBenefit": "Amount of current federal tax expense (benefit) pertaining to income (loss) from continuing operations.",
    "CurrentForeignTaxExpenseBenefit": "Amount of current foreign income tax expense (benefit) pertaining to income (loss) from continuing operations.",
    "CurrentStateAndLocalTaxExpenseBenefit": "Amount of current state and local tax expense (benefit) pertaining to income (loss) from continuing operations.",
    "DebtInstrumentCarryingAmount": "Amount, before unamortized (discount) premium and debt issuance costs, of long-term debt. Includes, but is not limited to, notes payable, bonds payable, commercial loans, mortgage loans, convertible debt, subordinated debt and other types of debt.",
    "DebtInstrumentUnamortizedDiscount": "Amount, after accumulated amortization, of debt discount.",
    "DebtInstrumentUnamortizedDiscountPremiumAndDebtIssuanceCostsNet": "Amount of unamortized debt discount (premium) and debt issuance costs.",
    "DebtInstrumentUnamortizedDiscountPremiumNet": "Amount, after accumulated amortization, of debt discount (premium).",
    "DebtSecuritiesAvailableForSaleContinuousUnrealizedLossPosition12MonthsOrLonger": "Amount of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), in continuous unrealized loss position for more than 12 months, without allowance for credit loss. Includes beneficial interest in securitized financial asset.",
    "DebtSecuritiesAvailableForSaleContinuousUnrealizedLossPosition12MonthsOrLongerAccumulatedLoss": "Amount of accumulated unrealized loss on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), in continuous unrealized loss position for 12 months or longer, without allowance for credit loss. Includes beneficial interest in securitized financial asset.",
    "DebtSecuritiesAvailableForSaleContinuousUnrealizedLossPositionLessThan12Months": "Amount of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), in continuous unrealized loss position for less than 12 months, without allowance for credit loss. Includes beneficial interest in securitized financial asset.",
    "DebtSecuritiesAvailableForSaleContinuousUnrealizedLossPositionLessThan12MonthsAccumulatedLoss": "Amount of accumulated unrealized loss on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), in continuous unrealized loss position for less than 12 months, without allowance for credit loss. Includes beneficial interest in securitized financial asset.",
    "DebtSecuritiesAvailableForSaleUnrealizedLossPosition": "Amount of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), in unrealized loss position without allowance for credit loss.",
    "DebtSecuritiesAvailableForSaleUnrealizedLossPositionAccumulatedLoss": "Amount of accumulated unrealized loss on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), in unrealized loss position, without allowance for credit loss. Includes beneficial interest in securitized financial asset.",
    "DecreaseInUnrecognizedTaxBenefitsIsReasonablyPossible": "Amount of decrease reasonably possible in the next twelve months for the unrecognized tax benefit.",
    "DeferredFederalIncomeTaxExpenseBenefit": "Amount of deferred federal income tax expense (benefit) pertaining to income (loss) from continuing operations.",
    "DeferredForeignIncomeTaxExpenseBenefit": "Amount of deferred foreign income tax expense (benefit) pertaining to income (loss) from continuing operations.",
    "DeferredIncomeTaxExpenseBenefit": "Amount of deferred income tax expense (benefit) pertaining to income (loss) from continuing operations.",
    "DeferredIncomeTaxLiabilities": "Amount of deferred tax liability attributable to taxable temporary differences.",
    "DeferredIncomeTaxLiabilitiesNet": "Amount, after deferred tax asset, of deferred tax liability attributable to taxable differences with jurisdictional netting.",
    "DeferredRevenueCurrent": "Amount of deferred income and obligation to transfer product and service to customer for which consideration has been received or is receivable, classified as current.",
    "DeferredRevenueNoncurrent": "Amount of deferred income and obligation to transfer product and service to customer for which consideration has been received or is receivable, classified as noncurrent.",
    "DeferredStateAndLocalIncomeTaxExpenseBenefit": "Amount of deferred state and local tax expense (benefit) pertaining to income (loss) from continuing operations.",
    "DeferredTaxAssetsDeferredIncome": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from deferred income.",
    "DeferredTaxAssetsGoodwillAndIntangibleAssets": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from intangible assets including goodwill.",
    "DeferredTaxAssetsGross": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences and carryforwards.",
    "DeferredTaxAssetsLiabilitiesNet": "Amount, after allocation of valuation allowances and deferred tax liability, of deferred tax asset attributable to deductible differences and carryforwards, without jurisdictional netting.",
    "DeferredTaxAssetsLiabilitiesNetCurrent": "Amount, after allocation of valuation allowances and deferred tax liability, of deferred tax asset attributable to deductible differences and carryforwards, netted by jurisdiction and classified as current.",
    "DeferredTaxAssetsNet": "Amount after allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences and carryforwards.",
    "DeferredTaxAssetsNetCurrent": "Amount after allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences and carryforwards classified as current.",
    "DeferredTaxAssetsOther": "Amount, before allocation of valuation allowance, of deferred tax asset attributable to deductible temporary differences, classified as other.",
    "DeferredTaxAssetsPropertyPlantAndEquipment": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from property, plant, and equipment.",
    "DeferredTaxAssetsTaxCreditCarryforwards": "Amount, before allocation of a valuation allowances, of deferred tax assets attributable to deductible tax credit carryforwards including, but not limited to, research, foreign, general business, alternative minimum tax, and other deductible tax credit carryforwards.",
    "DeferredTaxAssetsTaxCreditCarryforwardsForeign": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible foreign tax credit carryforwards.",
    "DeferredTaxAssetsTaxCreditCarryforwardsResearch": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible research tax credit carryforwards.",
    "DeferredTaxAssetsTaxDeferredExpenseCompensationAndBenefitsShareBasedCompensationCost": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from share-based compensation.",
    "DeferredTaxAssetsTaxDeferredExpenseReservesAndAccruals": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from reserves and accruals.",
    "DeferredTaxAssetsUnrealizedLossesOnAvailableforSaleSecuritiesGross": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from unrealized losses on available-for-sale securities.",
    "DeferredTaxAssetsValuationAllowance": "Amount of deferred tax assets for which it is more likely than not that a tax benefit will not be realized.",
    "DeferredTaxLiabilities": "Amount, after deferred tax asset, of deferred tax liability attributable to taxable differences without jurisdictional netting.",
    "DeferredTaxLiabilitiesLeasingArrangements": "Amount of deferred tax liability attributable to taxable temporary differences from leasing arrangements.",
    "DeferredTaxLiabilitiesNoncurrent": "Amount, after deferred tax asset, of deferred tax liability attributable to taxable differences, with jurisdictional netting and classified as noncurrent.",
    "DeferredTaxLiabilitiesOther": "Amount of deferred tax liability attributable to taxable temporary differences classified as other.",
    "DeferredTaxLiabilitiesOtherComprehensiveIncome": "Amount of deferred tax liability attributable to taxable temporary differences from unrealized gains in other comprehensive income.",
    "DeferredTaxLiabilitiesUndistributedForeignEarnings": "Amount of deferred tax liability attributable to taxable temporary differences from undistributed earnings of subsidiary and other recognized entity not within country of domicile. Includes, but is not limited to, other basis differences.",
    "DeferredTaxLiabilityNotRecognizedAmountOfUnrecognizedDeferredTaxLiabilityUndistributedEarningsOfForeignSubsidiaries": "Amount of deferred tax liability not recognized because of the exceptions to comprehensive recognition of deferred taxes related to undistributed earnings of foreign subsidiaries.",
    "DefinedContributionPlanCostRecognized": "Amount of cost for defined contribution plan.",
    "DefinedContributionPlanMaximumAnnualContributionPerEmployeeAmount": "Maximum amount per employee, by the terms of the plan, that the employer may contribute to a defined contribution plan.",
    "DefinedContributionPlanMaximumAnnualContributionsPerEmployeeAmount": "Maximum amount the employee may contribute to a defined contribution plan.",
    "Depreciation": "The amount of expense recognized in the current period that reflects the allocation of the cost of tangible assets over the assets' useful lives. Includes production and non-production related depreciation.",
    "DepreciationAmortizationAndAccretionNet": "The aggregate net amount of depreciation, amortization, and accretion recognized during an accounting period. As a noncash item, the net amount is added back to net income when calculating cash provided by or used in operations using the indirect method.",
    "DepreciationAndAmortization": "The current period expense charged against earnings on long-lived, physical assets not used in production, and which are not intended for resale, to allocate or recognize the cost of such assets over their useful lives; or to record the reduction in book value of an intangible asset over the benefit period of such asset; or to reflect consumption during the period of an asset that is not used in production.",
    "DepreciationDepletionAndAmortization": "The aggregate expense recognized in the current period that allocates the cost of tangible assets, intangible assets, or depleting assets to periods that benefit from use of the assets.",
    "DerivativeCollateralObligationToReturnCash": "Amount of obligation to return cash collateral under master netting arrangements that have not been offset against derivative assets.",
    "DerivativeFairValueOfDerivativeNet": "Fair value of the assets less the liabilities of a derivative or group of derivatives.",
    "DerivativeInstrumentsGainLossReclassifiedFromAccumulatedOCIIntoIncomeEffectivePortionNet": "The effective portion of net gain (loss) reclassified from accumulated other comprehensive income into income on derivative instruments designated and qualifying as hedging instruments.",
    "DerivativeInstrumentsGainLossRecognizedInIncomeIneffectivePortionAndAmountExcludedFromEffectivenessTestingNet": "The portion of gains and losses (net) on derivative instruments designated and qualifying as hedging instruments representing (a) the amount of the hedge ineffectiveness and (b) the amount, if any, excluded from the assessment of hedge effectiveness.",
    "DerivativeInstrumentsGainLossRecognizedInOtherComprehensiveIncomeEffectivePortionNet": "The effective portion of gains and losses (net) on derivative instruments designated and qualifying as hedging instruments that was recognized in other comprehensive income during the current period.",
    "DerivativeInstrumentsNotDesignatedAsHedgingInstrumentsGainLossNet": "Amount of realized and unrealized gain (loss) of derivative instruments not designated or qualifying as hedging instruments.",
    "Dividends": "Amount of paid and unpaid cash, stock, and paid-in-kind (PIK) dividends declared, for example, but not limited to, common and preferred stock.",
    "EarningsPerShareBasic": "The amount of net income (loss) for the period per each share of common stock or unit outstanding during the reporting period.",
    "EarningsPerShareDiluted": "The amount of net income (loss) for the period available to each share of common stock or common unit outstanding during the reporting period and to each share or unit that would have been outstanding assuming the issuance of common shares or units for all dilutive potential common shares or units outstanding during the reporting period.",
    "EffectiveIncomeTaxRateContinuingOperations": "Percentage of current income tax expense (benefit) and deferred income tax expense (benefit) pertaining to continuing operations.",
    "EffectiveIncomeTaxRateReconciliationAtFederalStatutoryIncomeTaxRate": "Percentage of domestic federal statutory tax rate applicable to pretax income (loss).",
    "EffectiveIncomeTaxRateReconciliationForeignIncomeTaxRateDifferential": "Percentage of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations applicable to statutory income tax expense (benefit) outside of the country of domicile.",
    "EffectiveIncomeTaxRateReconciliationShareBasedCompensationExcessTaxBenefitAmount": "Amount of difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying domestic federal statutory income tax rate to pretax income (loss) from continuing operation, attributable to expense for award under share-based payment arrangement. Excludes expense determined to be nondeductible upon grant or after for award under share-based payment arrangement.",
    "EffectiveIncomeTaxRateReconciliationTaxCutsAndJobsActOf2017Amount": "Amount of reported income tax expense (benefit) in excess of (less than) expected income tax expense (benefit) computed by applying domestic federal statutory income tax rate to pretax income (loss) from continuing operations, attributable to Tax Cuts and Jobs Act.",
    "EmployeeRelatedLiabilitiesCurrent": "Total of the carrying values as of the balance sheet date of obligations incurred through that date and payable for obligations related to services received from employees, such as accrued salaries and bonuses, payroll taxes and fringe benefits. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer).",
    "EmployeeServiceShareBasedCompensationCashFlowEffectCashUsedToSettleAwards": "Aggregate cash paid by the entity during the period to settle equity instruments granted under equity-based payment arrangements.",
    "EmployeeServiceShareBasedCompensationNonvestedAwardsTotalCompensationCostNotYetRecognized": "Amount of cost not yet recognized for nonvested award under share-based payment arrangement.",
    "EmployeeServiceShareBasedCompensationNonvestedAwardsTotalCompensationCostNotYetRecognizedPeriodForRecognition": "The weighted average period over which unrecognized compensation is expected to be recognized for equity-based compensation plans, using a decimal to express in number of years.",
    "EmployeeServiceShareBasedCompensationTaxBenefitFromCompensationExpense": "Amount of tax benefit for recognition of expense of award under share-based payment arrangement.",
    "EmployeeServiceShareBasedCompensationUnrecognizedCompensationCostsOnNonvestedAwards": "As of the latest balance sheet date presented, the total compensation cost related to outstanding, nonvested equity-based compensation awards not yet recognized (will be charged against earnings as services are performed or other vesting criteria are met).",
    "EmployeeServiceShareBasedCompensationUnrecognizedCompensationCostsOnNonvestedAwardsWeightedAveragePeriodOfRecognition": "The weighted average period over which unrecognized equity-based compensation costs are expected to be reported.",
    "EquitySecuritiesWithoutReadilyDeterminableFairValueAmount": "Amount of investment in equity security without readily determinable fair value.",
    "ExcessTaxBenefitFromShareBasedCompensationFinancingActivities": "Amount of cash inflow from realized tax benefit related to deductible compensation cost reported on the entity's tax return for equity instruments in excess of the compensation cost for those instruments recognized for financial reporting purposes.",
    "FairValueAssetsMeasuredOnRecurringBasisCashAndCashEquivalents": "This element represents a certain statement of financial position asset caption which represents a class of assets, or which may include an individual asset, measured at fair value on a recurring basis.",
    "FairValueAssetsMeasuredOnRecurringBasisDerivativeFinancialInstrumentsAssets": "This element represents a certain statement of financial position asset caption which represents a class of assets, or which may include an individual asset, measured at fair value on a recurring basis.",
    "FairValueHedgesAtFairValueNet": "Net fair value of all derivative instruments designated as fair value hedging instruments.",
    "FairValueLiabilitiesMeasuredOnRecurringBasisDerivativeFinancialInstrumentsLiabilities": "This element represents a certain statement of financial position liability caption which represents a class of liabilities, or which may include an individual liability, measured at fair value on a recurring basis.",
    "FederalIncomeTaxExpenseBenefitContinuingOperations": "Amount of current and deferred federal income tax expense (benefit) attributable to income (loss) from continuing operations.",
    "FinanceLeaseLiability": "Present value of lessee's discounted obligation for lease payments from finance lease.",
    "FinanceLeaseLiabilityCurrent": "Present value of lessee's discounted obligation for lease payments from finance lease, classified as current.",
    "FinanceLeaseLiabilityNoncurrent": "Present value of lessee's discounted obligation for lease payments from finance lease, classified as noncurrent.",
    "FinanceLeaseLiabilityPaymentsDue": "Amount of lessee's undiscounted obligation for lease payments for finance lease.",
    "FinanceLeaseLiabilityPaymentsDueAfterYearFive": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "FinanceLeaseLiabilityPaymentsDueNextTwelveMonths": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "FinanceLeaseLiabilityPaymentsDueYearFive": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "FinanceLeaseLiabilityPaymentsDueYearFour": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "FinanceLeaseLiabilityPaymentsDueYearThree": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "FinanceLeaseLiabilityPaymentsDueYearTwo": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "FinanceLeaseLiabilityPaymentsRemainderOfFiscalYear": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in remainder of current fiscal year.",
    "FinanceLeaseLiabilityUndiscountedExcessAmount": "Amount of lessee's undiscounted obligation for lease payments in excess of discounted obligation for lease payments for finance lease.",
    "FinanceLeaseRightOfUseAsset": "Amount, after accumulated amortization, of right-of-use asset from finance lease.",
    "FiniteLivedIntangibleAssetsAccumulatedAmortization": "Accumulated amount of amortization of assets, excluding financial assets and goodwill, lacking physical substance with a finite life.",
    "FiniteLivedIntangibleAssetsAmortizationExpense": "Aggregate amount of intangible asset amortization recognized as expense during the period.",
    "FiniteLivedIntangibleAssetsAmortizationExpenseAfterYearFive": "Amount of amortization for asset, excluding financial asset and goodwill, lacking physical substance with finite life expected to be recognized after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "FiniteLivedIntangibleAssetsAmortizationExpenseNextTwelveMonths": "Amount of amortization for assets, excluding financial assets and goodwill, lacking physical substance with finite life expected to be recognized in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "FiniteLivedIntangibleAssetsAmortizationExpenseYearFive": "Amount of amortization for assets, excluding financial assets and goodwill, lacking physical substance with finite life expected to be recognized in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "FiniteLivedIntangibleAssetsAmortizationExpenseYearFour": "Amount of amortization for assets, excluding financial assets and goodwill, lacking physical substance with finite life expected to be recognized in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "FiniteLivedIntangibleAssetsAmortizationExpenseYearThree": "Amount of amortization for assets, excluding financial assets and goodwill, lacking physical substance with finite life expected to be recognized in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "FiniteLivedIntangibleAssetsAmortizationExpenseYearTwo": "Amount of amortization for assets, excluding financial assets and goodwill, lacking physical substance with finite life expected to be recognized in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "FiniteLivedIntangibleAssetsGross": "Amount before amortization of assets, excluding financial assets and goodwill, lacking physical substance with a finite life.",
    "FiniteLivedIntangibleAssetsNet": "Amount after amortization of assets, excluding financial assets and goodwill, lacking physical substance with a finite life.",
    "FiniteLivedIntangibleAssetsUsefulLifeMaximum": "The maximum useful life of a major finite-lived intangible asset class. A major class is composed of intangible assets that can be grouped together because they are similar either by their nature or by their use in the operations of a company.",
    "FiniteLivedIntangibleAssetsUsefulLifeMinimum": "The minimum useful life of a major finite-lived intangible asset class. A major class is composed of intangible assets that can be grouped together because they are similar either by their nature or by their use in the operations of a company.",
    "ForeignCurrencyDerivativeAssetsAtFairValue": "Fair value as of the balance sheet date of foreign currency derivative assets, which includes all such derivative instruments in hedging and nonhedging relationships that are recognized as assets on the balance sheet.",
    "ForeignCurrencyDerivativeInstrumentsNotDesignatedAsHedgingInstrumentsAssetAtFairValue": "Fair value as of the balance sheet date of all foreign currency derivative assets not designated as hedging instruments.",
    "ForeignCurrencyDerivativeInstrumentsNotDesignatedAsHedgingInstrumentsLiabilityAtFairValue": "Fair value as of the balance sheet date of all foreign currency derivative liabilities not designated as hedging instruments.",
    "ForeignCurrencyDerivativeLiabilitiesAtFairValue": "Fair value as of the balance sheet date of interest rate derivative liabilities, which includes all such derivative instruments in hedging and nonhedging relationships that are recognized as liabilities on the balance sheet.",
    "ForeignIncomeTaxExpenseBenefitContinuingOperations": "Amount of current and deferred foreign income tax expense (benefit) attributable to income (loss) from continuing operations.",
    "FurnitureAndFixturesGross": "Amount before accumulated depreciation of equipment commonly used in offices and stores that have no permanent connection to the structure of a building or utilities. Examples include, but are not limited to, desks, chairs, tables, and bookcases.",
    "FutureAmortizationExpenseYearFive": "The amount of amortization expense expected to be recognized during year five of the five succeeding fiscal years.",
    "FutureAmortizationExpenseYearFour": "The amount of amortization expense expected to be recognized during year four of the five succeeding fiscal years.",
    "FutureAmortizationExpenseYearOne": "The amount of amortization expense expected to be recognized during year one of the five succeeding fiscal years.",
    "FutureAmortizationExpenseYearThree": "The amount of amortization expense expected to be recognized during year three of the five succeeding fiscal years.",
    "FutureAmortizationExpenseYearTwo": "The amount of amortization expense expected to be recognized during year two of the five succeeding fiscal years.",
    "GainLossFromComponentsExcludedFromAssessmentOfFairValueHedgeEffectivenessNet": "Net gain (loss) relating to components of the gain (loss) on the fair value hedging instrument excluded from the assessment of fair value hedge effectiveness. Recognized in earnings.",
    "GainLossOnSaleOfPropertyPlantEquipment": "Amount of gain (loss) on sale or disposal of property, plant and equipment assets, including oil and gas property and timber property.",
    "Goodwill": "Amount after accumulated impairment loss of an asset representing future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized.",
    "GoodwillAcquiredDuringPeriod": "Amount of increase in asset representing future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized resulting from a business combination.",
    "GoodwillImpairmentLoss": "Amount of loss from the write-down of an asset representing the future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized.",
    "GrossProfit": "Aggregate revenue less cost of goods and services sold or operating expenses directly attributable to the revenue generation activity.",
    "HeldToMaturitySecurities": "Amount of investment in debt security measured at amortized cost (held-to-maturity).",
    "ImpairmentOfIntangibleAssetsExcludingGoodwill": "The amount of impairment loss recognized in the period resulting from the write-down of the carrying amount of an intangible asset (excluding goodwill) to fair value.",
    "ImpairmentOfIntangibleAssetsIndefinitelivedExcludingGoodwill": "Amount of impairment loss resulting from write-down of assets, excluding financial assets and goodwill, lacking physical substance and having a projected indefinite period of benefit to fair value.",
    "IncomeLossFromContinuingOperationsBeforeIncomeTaxesExtraordinaryItemsNoncontrollingInterest": "Amount of income (loss) from continuing operations, including income (loss) from equity method investments, before deduction of income tax expense (benefit), and income (loss) attributable to noncontrolling interest.",
    "IncomeLossFromContinuingOperationsBeforeIncomeTaxesForeign": "The portion of earnings or loss from continuing operations before income taxes that is attributable to foreign operations, which is defined as Income or Loss generated from operations located outside the entity's country of domicile.",
    "IncomeLossFromContinuingOperationsBeforeIncomeTaxesMinorityInterestAndIncomeLossFromEquityMethodInvestments": "Amount of income (loss) from continuing operations before deduction of income tax expense (benefit) and income (loss) attributable to noncontrolling interest, and addition of income (loss) from equity method investments.",
    "IncomeTaxExaminationInterestExpense": "The amount of estimated interest recognized in the period arising from income tax examinations.",
    "IncomeTaxExpenseBenefit": "Amount of current income tax expense (benefit) and deferred income tax expense (benefit) pertaining to continuing operations.",
    "IncomeTaxesPaidNet": "The amount of cash paid during the current period to foreign, federal, state, and local authorities as taxes on income, net of any cash received during the current period as refunds for the overpayment of taxes.",
    "IncomeTaxReconciliationDeductionsQualifiedProductionActivities": "Amount of the difference between reported income tax expense (benefit) and the expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to deduction for qualified production activity.",
    "IncomeTaxReconciliationForeignIncomeTaxRateDifferential": "Amount of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to foreign income tax expense (benefit).",
    "IncomeTaxReconciliationIncomeTaxExpenseBenefitAtFederalStatutoryIncomeTaxRate": "The amount of income tax expense or benefit for the period computed by applying the domestic federal statutory tax rates to pretax income from continuing operations.",
    "IncomeTaxReconciliationNondeductibleExpenseShareBasedCompensationCost": "Amount of reported income tax expense (benefit) in excess of (less than) expected income tax expense (benefit) computed by applying domestic federal statutory income tax rate to pretax income (loss) from continuing operation, attributable to nondeductible expense for award under share-based payment arrangement. Includes, but is not limited to, expense determined to be nondeductible upon grant or after for award under share-based payment arrangement.",
    "IncomeTaxReconciliationOtherAdjustments": "Amount of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to other adjustments.",
    "IncomeTaxReconciliationOtherReconcilingItems": "Amount of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to tax exempt income, equity in earnings (loss) of an unconsolidated subsidiary, minority noncontrolling interest income (loss), tax holiday, disposition of a business, disposition of an asset, repatriation of foreign earnings, repatriation of foreign earnings jobs creation act of 2004, increase (decrease) in enacted tax rate, prior year income taxes, increase (decrease) in deferred tax asset valuation allowance, and other adjustments.",
    "IncomeTaxReconciliationStateAndLocalIncomeTaxes": "Amount of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to state and local income tax expense (benefit).",
    "IncomeTaxReconciliationTaxContingenciesDomestic": "Amount of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to increase (decrease) in domestic income tax contingency.",
    "IncomeTaxReconciliationTaxCreditsResearch": "Amount of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to research tax credit.",
    "IncomeTaxReconciliationTaxSettlementsDomestic": "Amount of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to domestic income tax settlement.",
    "IncreaseDecreaseInAccountsPayable": "The increase (decrease) during the reporting period in the aggregate amount of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business.",
    "IncreaseDecreaseInAccountsReceivable": "The increase (decrease) during the reporting period in amount due within one year (or one business cycle) from customers for the credit sale of goods and services.",
    "IncreaseDecreaseInContractWithCustomerLiability": "Amount of increase (decrease) in obligation to transfer good or service to customer for which consideration has been received or is receivable.",
    "IncreaseDecreaseInDeferredRevenue": "Amount of increase (decrease) in deferred income and obligation to transfer product and service to customer for which consideration has been received or is receivable.",
    "IncreaseDecreaseInInventories": "The increase (decrease) during the reporting period in the aggregate value of all inventory held by the reporting entity, associated with underlying transactions that are classified as operating activities.",
    "IncreaseDecreaseInOtherOperatingAssets": "Amount of increase (decrease) in operating assets classified as other.",
    "IncreaseDecreaseInOtherOperatingLiabilities": "Amount of increase (decrease) in operating liabilities classified as other.",
    "IncreaseDecreaseInOtherReceivables": "Amount of increase (decrease) in receivables classified as other.",
    "IndefiniteLivedIntangibleAssetsExcludingGoodwill": "Amount of assets, excluding financial assets and goodwill, lacking physical substance and having a projected indefinite period of benefit.",
    "IntangibleAssetsGrossExcludingGoodwill": "Amount before accumulated amortization of intangible assets, excluding goodwill.",
    "IntangibleAssetsNetExcludingGoodwill": "Sum of the carrying amounts of all intangible assets, excluding goodwill, as of the balance sheet date, net of accumulated amortization and impairment charges.",
    "InterestCostsIncurred": "Total interest costs incurred during the period and either capitalized or charged against earnings.",
    "InterestExpense": "Amount of the cost of borrowed funds accounted for as interest expense.",
    "InterestExpenseDebt": "Amount of the cost of borrowed funds accounted for as interest expense for debt.",
    "InterestPaid": "Amount of cash paid for interest, including, but not limited to, capitalized interest and payment to settle zero-coupon bond attributable to accreted interest of debt discount and debt instrument with insignificant coupon interest rate in relation to effective interest rate of borrowing attributable to accreted interest of debt discount; classified as operating and investing activities.",
    "InterestPaidNet": "Amount of cash paid for interest, excluding capitalized interest, classified as operating activity. Includes, but is not limited to, payment to settle zero-coupon bond for accreted interest of debt discount and debt instrument with insignificant coupon interest rate in relation to effective interest rate of borrowing attributable to accreted interest of debt discount.",
    "InventoryFinishedGoodsNetOfReserves": "Carrying amount, net of valuation reserves and adjustments, as of the balance sheet date of merchandise or goods held by the company that are readily available for sale.",
    "InventoryNet": "Amount after valuation and LIFO reserves of inventory expected to be sold, or consumed within one year or operating cycle, if longer.",
    "InventoryPartsAndComponentsNetOfReserves": "Carrying amount, net of valuation reserves and adjustments, as of the balance sheet date for elements of machinery or equipment held for the purpose of replacing similar parts in the course of repair or maintenance.",
    "InvestmentIncomeInterestAndDividend": "Amount before accretion (amortization) of purchase discount (premium) of interest income and dividend income on nonoperating securities.",
    "LeaseAndRentalExpense": "Amount of rent expense incurred for leased assets, including but not limited to, furniture and equipment, that is not directly or indirectly associated with the manufacture, sale or creation of a product or product line.",
    "LeaseholdImprovementsGross": "Amount before accumulated depreciation of additions or improvements to assets held under a lease arrangement.",
    "LesseeOperatingLeaseLiabilityPaymentsDue": "Amount of lessee's undiscounted obligation for lease payment for operating lease.",
    "LesseeOperatingLeaseLiabilityPaymentsDueAfterYearFive": "Amount of lessee's undiscounted obligation for lease payment for operating lease due after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "LesseeOperatingLeaseLiabilityPaymentsDueNextTwelveMonths": "Amount of lessee's undiscounted obligation for lease payment for operating lease to be paid in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "LesseeOperatingLeaseLiabilityPaymentsDueYearFive": "Amount of lessee's undiscounted obligation for lease payment for operating lease to be paid in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "LesseeOperatingLeaseLiabilityPaymentsDueYearFour": "Amount of lessee's undiscounted obligation for lease payment for operating lease to be paid in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "LesseeOperatingLeaseLiabilityPaymentsDueYearThree": "Amount of lessee's undiscounted obligation for lease payment for operating lease to be paid in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "LesseeOperatingLeaseLiabilityPaymentsDueYearTwo": "Amount of lessee's undiscounted obligation for lease payment for operating lease to be paid in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "LesseeOperatingLeaseLiabilityPaymentsRemainderOfFiscalYear": "Amount of lessee's undiscounted obligation for lease payment for operating lease having initial or remaining lease term in excess of one year to be paid in remainder of current fiscal year.",
    "LesseeOperatingLeaseLiabilityUndiscountedExcessAmount": "Amount of lessee's undiscounted obligation for lease payments in excess of discounted obligation for lease payments for operating lease.",
    "Liabilities": "Sum of the carrying amounts as of the balance sheet date of all liabilities that are recognized. Liabilities are probable future sacrifices of economic benefits arising from present obligations of an entity to transfer assets or provide services to other entities in the future.",
    "LiabilitiesAndStockholdersEquity": "Amount of liabilities and equity items, including the portion of equity attributable to noncontrolling interests, if any.",
    "LiabilitiesCurrent": "Total obligations incurred as part of normal operations that are expected to be paid during the following twelve months or within one business cycle, if longer.",
    "LiabilitiesNoncurrent": "Amount of obligation due after one year or beyond the normal operating cycle, if longer.",
    "LongTermDebt": "Amount, after unamortized (discount) premium and debt issuance costs, of long-term debt. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations.",
    "LongTermDebtCurrent": "Amount, after unamortized (discount) premium and debt issuance costs, of long-term debt, classified as current. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations.",
    "LongTermDebtMaturitiesRepaymentsOfPrincipalAfterYearFive": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "LongTermDebtMaturitiesRepaymentsOfPrincipalInNextTwelveMonths": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "LongTermDebtMaturitiesRepaymentsOfPrincipalInYearFive": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "LongTermDebtMaturitiesRepaymentsOfPrincipalInYearFour": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "LongTermDebtMaturitiesRepaymentsOfPrincipalInYearThree": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "LongTermDebtMaturitiesRepaymentsOfPrincipalInYearTwo": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "LongTermDebtMaturitiesRepaymentsOfPrincipalRemainderOfFiscalYear": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing in remainder of current fiscal year.",
    "LongTermDebtNoncurrent": "Amount after unamortized (discount) premium and debt issuance costs of long-term debt classified as noncurrent and excluding amounts to be repaid within one year or the normal operating cycle, if longer. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations.",
    "LongTermPurchaseCommitmentAmount": "The minimum amount the entity agreed to spend under the long-term purchase commitment.",
    "MarketableSecuritiesCurrent": "Amount of investment in marketable security, classified as current.",
    "MarketableSecuritiesNoncurrent": "Amount of investment in marketable security, classified as noncurrent.",
    "MarketableSecuritiesRealizedGainLoss": "Amount of realized gain (loss) on investment in marketable security, including other-than-temporary impairment (OTTI).",
    "MarketingExpense": "Expenditures for planning and executing the conception, pricing, promotion, and distribution of ideas, goods, and services. Costs of public relations and corporate promotions are typically considered to be marketing costs.",
    "NetCashProvidedByUsedInFinancingActivities": "Amount of cash inflow (outflow) from financing activities, including discontinued operations. Financing activity cash flows include obtaining resources from owners and providing them with a return on, and a return of, their investment; borrowing money and repaying amounts borrowed, or settling the obligation; and obtaining and paying for other resources obtained from creditors on long-term credit.",
    "NetCashProvidedByUsedInFinancingActivitiesContinuingOperations": "Amount of cash inflow (outflow) of financing activities, excluding discontinued operations. Financing activity cash flows include obtaining resources from owners and providing them with a return on, and a return of, their investment; borrowing money and repaying amounts borrowed, or settling the obligation; and obtaining and paying for other resources obtained from creditors on long-term credit.",
    "NetCashProvidedByUsedInInvestingActivities": "Amount of cash inflow (outflow) from investing activities, including discontinued operations. Investing activity cash flows include making and collecting loans and acquiring and disposing of debt or equity instruments and property, plant, and equipment and other productive assets.",
    "NetCashProvidedByUsedInInvestingActivitiesContinuingOperations": "Amount of cash inflow (outflow) of investing activities, excluding discontinued operations. Investing activity cash flows include making and collecting loans and acquiring and disposing of debt or equity instruments and property, plant, and equipment and other productive assets.",
    "NetCashProvidedByUsedInOperatingActivities": "Amount of cash inflow (outflow) from operating activities, including discontinued operations. Operating activity cash flows include transactions, adjustments, and changes in value not defined as investing or financing activities.",
    "NetCashProvidedByUsedInOperatingActivitiesContinuingOperations": "Amount of cash inflow (outflow) from operating activities, excluding discontinued operations. Operating activity cash flows include transactions, adjustments, and changes in value not defined as investing or financing activities.",
    "NetIncomeLoss": "The portion of profit or loss for the period, net of income taxes, which is attributable to the parent.",
    "NoncurrentAssets": "Long-lived assets other than financial instruments, long-term customer relationships of a financial institution, mortgage and other servicing rights, deferred policy acquisition costs, and deferred tax assets.",
    "NonoperatingIncomeExpense": "The aggregate amount of income or expense from ancillary business-related activities (that is to say, excluding major activities considered part of the normal operations of the business).",
    "NontradeReceivablesCurrent": "The sum of amounts currently receivable other than from customers. For classified balance sheets, represents the current amount receivable, that is amounts expected to be collected within one year or the normal operating cycle, if longer.",
    "NotionalAmountOfForeignCurrencyDerivativeInstrumentsNotDesignatedAsHedgingInstruments": "Aggregate notional amount of all foreign currency derivatives not designated as hedging instruments. Notional amount refers to the number of currency units specified in the foreign currency derivative contract.",
    "NumberOfStores": "Represents the number of stores.",
    "OciBeforeReclassificationsBeforeTaxAttributableToParent": "Amount before tax and reclassification adjustments of other comprehensive income (loss) attributable to parent.",
    "OperatingExpenses": "Generally recurring costs associated with normal operations except for the portion of these expenses which can be clearly related to production and included in cost of sales or services. Includes selling, general and administrative expense.",
    "OperatingIncomeLoss": "The net result for the period of deducting operating expenses from operating revenues.",
    "OperatingLeaseCost": "Amount of single lease cost, calculated by allocation of remaining cost of lease over remaining lease term. Includes, but is not limited to, single lease cost, after impairment of right-of-use asset, calculated by amortization of remaining right-of-use asset and accretion of lease liability.",
    "OperatingLeaseLiability": "Present value of lessee's discounted obligation for lease payments from operating lease.",
    "OperatingLeaseLiabilityCurrent": "Present value of lessee's discounted obligation for lease payments from operating lease, classified as current.",
    "OperatingLeaseLiabilityNoncurrent": "Present value of lessee's discounted obligation for lease payments from operating lease, classified as noncurrent.",
    "OperatingLeasePayments": "Amount of cash outflow from operating lease, excluding payments to bring another asset to condition and location necessary for its intended use.",
    "OperatingLeaseRightOfUseAsset": "Amount of lessee's right to use underlying asset under operating lease.",
    "OperatingLeasesFutureMinimumPaymentsDue": "Amount of required minimum rental payments for leases having an initial or remaining non-cancelable letter-terms in excess of one year.",
    "OperatingLeasesFutureMinimumPaymentsDueCurrent": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due in the next fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
    "OperatingLeasesFutureMinimumPaymentsDueInFiveYears": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due in the fifth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
    "OperatingLeasesFutureMinimumPaymentsDueInFourYears": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due in the fourth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
    "OperatingLeasesFutureMinimumPaymentsDueInThreeYears": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due in the third fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
    "OperatingLeasesFutureMinimumPaymentsDueInTwoYears": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due in the second fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
    "OperatingLeasesFutureMinimumPaymentsDueThereafter": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due after the fifth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date.",
    "OperatingLeasesRentExpenseNet": "Rental expense for the reporting period incurred under operating leases, including minimum and any contingent rent expense, net of related sublease income.",
    "OtherAccruedLiabilitiesCurrent": "Amount of expenses incurred but not yet paid classified as other, due within one year or the normal operating cycle, if longer.",
    "OtherAccruedLiabilitiesNoncurrent": "Amount of expenses incurred but not yet paid classified as other, due after one year or the normal operating cycle, if longer.",
    "OtherAssetsCurrent": "Amount of current assets classified as other.",
    "OtherAssetsNoncurrent": "Amount of noncurrent assets classified as other.",
    "OtherComprehensiveIncomeAvailableForSaleSecuritiesAdjustmentNetOfTaxPeriodIncreaseDecrease": "Gross appreciation or the gross loss in value of the total unsold securities. While for technical reasons this element has no balance attribute, the default assumption is a credit balance consistent with its label.",
    "OtherComprehensiveIncomeDerivativesQualifyingAsHedgesNetOfTaxPeriodIncreaseDecrease": "Net of tax effect change in accumulated gains and losses from derivative instruments designated and qualifying as the effective portion of cash flow hedges after taxes. A cash flow hedge is a hedge of the exposure to variability in the cash flows of a recognized asset or liability or a forecasted transaction that is attributable to a particular risk. The change includes an entity's share of an equity investee's increase or decrease in deferred hedging gains or losses. While for technical reasons this element has no balance attribute, the default assumption is a credit balance consistent with its label.",
    "OtherComprehensiveIncomeForeignCurrencyTransactionAndTranslationAdjustmentNetOfTaxPeriodIncreaseDecrease": "Adjustment that results from the process of translating subsidiary financial statements and foreign equity investments into the reporting currency of the reporting entity, net of tax.",
    "OtherComprehensiveIncomeLossAvailableForSaleSecuritiesAdjustmentNetOfTax": "Amount, after tax and adjustment, of unrealized gain (loss) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale) and unrealized gain (loss) on investment in debt security measured at amortized cost (held-to-maturity) from transfer to available-for-sale.",
    "OtherComprehensiveIncomeLossBeforeReclassificationsBeforeTax": "Amount before tax and reclassification adjustments of other comprehensive income (loss).",
    "OtherComprehensiveIncomeLossBeforeReclassificationsNetOfTax": "Amount after tax, before reclassification adjustments of other comprehensive income (loss).",
    "OtherComprehensiveIncomeLossCashFlowHedgeGainLossBeforeReclassificationAndTax": "Amount, before tax and reclassification, of gain (loss) from derivative instrument designated and qualifying cash flow hedge included in assessment of hedge effectiveness.",
    "OtherComprehensiveIncomeLossCashFlowHedgeGainLossReclassificationAfterTax": "Amount, after tax, of reclassification of gain (loss) from accumulated other comprehensive income (AOCI) for derivative instrument designated and qualifying as cash flow hedge included in assessment of hedge effectiveness.",
    "OtherComprehensiveIncomeLossCashFlowHedgeGainLossReclassificationBeforeTax": "Amount, before tax, of reclassification of gain (loss) from accumulated other comprehensive income (AOCI) for derivative instrument designated and qualifying as cash flow hedge included in assessment of hedge effectiveness.",
    "OtherComprehensiveIncomeLossDerivativeExcludedComponentIncreaseDecreaseBeforeAdjustmentsAndTax": "Amount, before tax and adjustments, of gain (loss) from increase (decrease) in value of excluded component of derivative designated and qualifying as hedge. Adjustments include, but are not limited to, reclassifications for sale and settlement, and amounts recognized under systematic and rational method.",
    "OtherComprehensiveIncomeLossDerivativesQualifyingAsHedgesNetOfTax": "Amount after tax and reclassification adjustments, of increase (decrease) in accumulated gain (loss) from derivative instruments designated and qualifying as the effective portion of cash flow hedges and an entity's share of an equity investee's increase (decrease) in deferred hedging gain (loss).",
    "OtherComprehensiveIncomeLossForeignCurrencyTransactionAndTranslationAdjustmentNetOfTax": "Amount after tax and reclassification adjustments of gain (loss) on foreign currency translation adjustments, foreign currency transactions designated and effective as economic hedges of a net investment in a foreign entity and intra-entity foreign currency transactions that are of a long-term-investment nature.",
    "OtherComprehensiveIncomeLossForeignCurrencyTranslationAdjustmentTax": "Amount of tax expense (benefit), after reclassification adjustments of gain (loss) on foreign currency translation adjustments, foreign currency transactions designated and effective as economic hedges of a net investment in a foreign entity and intra-entity foreign currency transactions that are of a long-term-investment nature.",
    "OtherComprehensiveIncomeLossNetOfTax": "Amount after tax and reclassification adjustments of other comprehensive income (loss).",
    "OtherComprehensiveIncomeLossNetOfTaxPortionAttributableToParent": "Amount after tax of other comprehensive income (loss) attributable to parent entity.",
    "OtherComprehensiveIncomeLossReclassificationAdjustmentForSaleOfSecuritiesIncludedInNetIncomeNetOfTax": "Net of tax amount of the income statement impact of the reclassification adjustment for unrealized gain (loss) realized upon the sale of available-for-sale securities.",
    "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIForSaleOfSecuritiesBeforeTax": "Amount before tax of reclassification adjustment from accumulated other comprehensive income for unrealized gain (loss) realized upon the sale of available-for-sale securities.",
    "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIForSaleOfSecuritiesNetOfTax": "Amount after tax of reclassification adjustment from accumulated other comprehensive income for unrealized gain (loss) realized upon the sale of available-for-sale securities.",
    "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIForSaleOfSecuritiesTax": "Amount of tax expense (benefit) of reclassification adjustment from accumulated other comprehensive income for unrealized gain (loss) realized upon the sale of available-for-sale securities.",
    "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIOnDerivativesBeforeTax": "Amount before tax of reclassification adjustment from accumulated other comprehensive income of accumulated gain (loss) realized from derivative instruments designated and qualifying as the effective portion of cash flow hedges and an entity's share of an equity investee's deferred hedging gain (loss).",
    "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIOnDerivativesNetOfTax": "Amount after tax of reclassification adjustment from accumulated other comprehensive income of accumulated gain (loss) realized from derivative instruments designated and qualifying as the effective portion of cash flow hedges and an entity's share of an equity investee's deferred hedging gain (loss).",
    "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIOnDerivativesTax": "Amount of tax expense (benefit) of reclassification adjustment from accumulated other comprehensive income of accumulated gain (loss) realized from derivative instruments designated and qualifying as the effective portion of cash flow hedges and an entity's share of an equity investee's deferred hedging gain (loss).",
    "OtherComprehensiveIncomeLossReclassificationAdjustmentOnDerivativesIncludedInNetIncomeNetOfTax": "Net of tax amount of the income statement impact of the reclassification adjustment of accumulated gain (loss) from derivative instruments designated and qualifying as the effective portion of cash flow hedges realized in net income. Also includes reclassification adjustments of an entity's share of an equity investee's deferred hedging gain (loss) realized in net income.",
    "OtherComprehensiveIncomeLossReclassificationAdjustmentOnDerivativesIncludedInNetIncomeTax": "Tax effect of the income statement impact of the reclassification adjustment of accumulated gain (loss) from derivative instruments designated and qualifying as the effective portion of cash flow hedges realized in net income. Also includes reclassification adjustments of an entity's share of an equity investee's deferred hedging gain (loss) realized in net income.",
    "OtherComprehensiveIncomeLossTax": "Amount of tax expense (benefit) allocated to other comprehensive income (loss).",
    "OtherComprehensiveIncomeLossTaxPortionAttributableToParent1": "Amount of tax expense (benefit) allocated to other comprehensive income (loss) attributable to parent entity.",
    "OtherComprehensiveIncomeReclassificationAdjustmentOnDerivativesIncludedInNetIncomeNetOfTax": "Net of tax effect of the reclassification adjustment for accumulated gains and losses from derivative instrument designated and qualifying as the effective portion of cash flow hedges included in accumulated comprehensive income that was realized in net income during the period.",
    "OtherComprehensiveIncomeReclassificationAdjustmentOnDerivativesIncludedInNetIncomeTax": "Tax effect on reclassification adjustment for accumulated gains and losses from derivative instrument designated and qualifying as the effective portion of cash flow hedges included in accumulated comprehensive income that was realized in net income during the period.",
    "OtherComprehensiveIncomeUnrealizedGainLossOnDerivativesArisingDuringPeriodNetOfTax": "Amount after tax of increase (decrease) in accumulated gain (loss) from derivative instruments designated and qualifying as the effective portion of cash flow hedges and an entity's share of an equity investee's increase (decrease) in deferred hedging gain (loss).",
    "OtherComprehensiveIncomeUnrealizedGainLossOnDerivativesArisingDuringPeriodTax": "Amount of tax expense (benefit), before reclassification adjustments, related to increase (decrease) in accumulated gain (loss) from derivative instruments designated and qualifying as the effective portion of cash flow hedges and an entity's share of an equity investee's increase (decrease) in deferred hedging gain (loss).",
    "OtherComprehensiveIncomeUnrealizedHoldingGainLossOnSecuritiesArisingDuringPeriodNetOfTax": "Amount, after tax and before adjustment, of unrealized holding gain (loss) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale). Excludes unrealized gain (loss) on investment in debt security measured at amortized cost (held-to-maturity) from transfer to available-for-sale.",
    "OtherComprehensiveIncomeUnrealizedHoldingGainLossOnSecuritiesArisingDuringPeriodTax": "Amount, before adjustment, of tax expense (benefit) for unrealized holding gain (loss) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale). Excludes tax expense (benefit) for unrealized gain (loss) on investment in debt security measured at amortized cost (held-to-maturity) from transfer to available-for-sale.",
    "OtherDeferredCreditsCurrent": "Amount of unearned revenue or income classified as other, expected to be taken into income within one year or the normal operating cycle, if longer.",
    "OtherLiabilitiesCurrent": "Amount of liabilities classified as other, due within one year or the normal operating cycle, if longer.",
    "OtherLiabilitiesNoncurrent": "Amount of liabilities classified as other, due after one year or the normal operating cycle, if longer.",
    "OtherNoncashIncomeExpense": "Amount of income (expense) included in net income that results in no cash inflow (outflow), classified as other.",
    "OtherNonoperatingIncomeExpense": "Amount of income (expense) related to nonoperating activities, classified as other.",
    "OtherPrepaidExpenseCurrent": "Amount of asset related to consideration paid in advance for other costs that provide economic benefits within a future period of one year or the normal operating cycle, if longer.",
    "OtherShortTermBorrowings": "Amount of borrowings classified as other, maturing within one year or the normal operating cycle, if longer.",
    "PaymentsForProceedsFromOtherInvestingActivities": "Amount of cash (inflow) outflow from investing activities classified as other.",
    "PaymentsForRepurchaseOfCommonStock": "The cash outflow to reacquire common stock during the period.",
    "PaymentsOfDividends": "Cash outflow in the form of capital distributions and dividends to common shareholders, preferred shareholders and noncontrolling interests.",
    "PaymentsOfDividendsCommonStock": "Amount of cash outflow in the form of ordinary dividends to common shareholders of the parent entity.",
    "PaymentsRelatedToTaxWithholdingForShareBasedCompensation": "Amount of cash outflow to satisfy grantee's tax withholding obligation for award under share-based payment arrangement.",
    "PaymentsToAcquireAvailableForSaleSecurities": "The cash outflow to acquire debt and equity securities not classified as either held-to-maturity securities or trading securities which would be classified as available-for-sale securities and reported at fair value, with unrealized gains and losses excluded from earnings and reported in a separate component of shareholders' equity.",
    "PaymentsToAcquireAvailableForSaleSecuritiesDebt": "Amount of cash outflow to acquire investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale).",
    "PaymentsToAcquireBusinessesNetOfCashAcquired": "The cash outflow associated with the acquisition of a business, net of the cash acquired from the purchase.",
    "PaymentsToAcquireIntangibleAssets": "The cash outflow to acquire asset without physical form usually arising from contractual or other legal rights, excluding goodwill.",
    "PaymentsToAcquireOtherInvestments": "Amount of cash outflow to acquire investments classified as other.",
    "PaymentsToAcquireProductiveAssets": "The cash outflow for purchases of and capital improvements on property, plant and equipment (capital expenditures), software, and other intangible assets.",
    "PaymentsToAcquirePropertyPlantAndEquipment": "The cash outflow associated with the acquisition of long-lived, physical assets that are used in the normal conduct of business to produce goods and services and not intended for resale; includes cash outflows to pay for construction of self-constructed assets.",
    "PreferredStockSharesAuthorized": "The maximum number of nonredeemable preferred shares (or preferred stock redeemable solely at the option of the issuer) permitted to be issued by an entity's charter and bylaws.",
    "PrepaidExpenseOtherNoncurrent": "Carrying amount as of the balance sheet date of amounts paid in advance which will be charged against earnings in periods after one year or beyond the operating cycle, if longer.",
    "ProceedsFromIssuanceOfCommonStock": "The cash inflow from the additional capital contribution to the entity.",
    "ProceedsFromIssuanceOfLongTermDebt": "The cash inflow from a debt initially having maturity due after one year or beyond the operating cycle, if longer.",
    "ProceedsFromMaturitiesPrepaymentsAndCallsOfAvailableForSaleSecurities": "Amount of cash inflow from maturity, prepayment and call of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale).",
    "ProceedsFromOtherShortTermDebt": "Amount of cash inflow from short-term debt classified as other.",
    "ProceedsFromPaymentsForOtherFinancingActivities": "Amount of cash inflow (outflow) from financing activities classified as other.",
    "ProceedsFromRepaymentsOfCommercialPaper": "The net cash inflow or cash outflow from issuing (borrowing) and repaying commercial paper.",
    "ProceedsFromRepaymentsOfShortTermDebt": "The net cash inflow or outflow for borrowing having initial term of repayment within one year or the normal operating cycle, if longer.",
    "ProceedsFromRepaymentsOfShortTermDebtMaturingInMoreThanThreeMonths": "The cash inflow from a borrowing net of the cash outflow from repayment of a borrowing having initial term of repayment of more than three months but less than one year or one operating cycle (if the normal cycle is more than one year).",
    "ProceedsFromRepaymentsOfShortTermDebtMaturingInThreeMonthsOrLess": "The cash inflow from a borrowing net of the cash outflow from repayment of a borrowing having initial term of repayment within three months.",
    "ProceedsFromSaleAndMaturityOfOtherInvestments": "The cash inflow associated with the sale and maturity (principal being due) of other investments, prepayment and call (request of early payment) of other investments not otherwise defined in the taxonomy.",
    "ProceedsFromSaleOfAvailableForSaleSecurities": "The cash inflow associated with the sale of debt and equity securities classified as available-for-sale securities.",
    "ProceedsFromSaleOfAvailableForSaleSecuritiesDebt": "Amount of cash inflow from sale of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale).",
    "ProceedsFromShortTermDebtMaturingInMoreThanThreeMonths": "The cash inflow from a borrowing having initial term of repayment of more than three months but less than one year or one operating cycle (if the normal cycle is more than one year).",
    "ProductWarrantyAccrualClassifiedCurrent": "Carrying value as of the balance sheet date of obligations incurred through that date and payable for estimated claims under standard and extended warranty protection rights granted to customers. For classified balance sheets, represents the current portion of the liabilities (due within one year or within the normal operating cycle if longer).",
    "ProductWarrantyAccrualPayments": "Amount of decrease in the standard and extended product warranty accrual from payments made in cash or in kind to satisfy claims under the terms of the standard and extended product warranty.",
    "ProductWarrantyAccrualWarrantiesIssued": "Amount of increase in the standard and extended product warranty accrual from warranties issued.",
    "ProductWarrantyExpense": "The expense charged against earnings for the period pertaining to standard and extended warranties on the entity's goods and services granted to customers.",
    "PropertyPlantAndEquipmentGross": "Amount before accumulated depreciation, depletion and amortization of physical assets used in the normal conduct of business and not intended for resale. Examples include, but are not limited to, land, buildings, machinery and equipment, office equipment, and furniture and fixtures.",
    "PropertyPlantAndEquipmentNet": "Amount after accumulated depreciation, depletion and amortization of physical assets used in the normal conduct of business to produce goods and services and not intended for resale. Examples include, but are not limited to, land, buildings, machinery and equipment, office equipment, and furniture and fixtures.",
    "ReclassificationFromAccumulatedOtherComprehensiveIncomeCurrentPeriodBeforeTax": "Amount before tax of reclassification adjustments of other comprehensive income (loss).",
    "ReclassificationFromAccumulatedOtherComprehensiveIncomeCurrentPeriodNetOfTax": "Amount after tax of reclassification adjustments of other comprehensive income (loss).",
    "ReclassificationFromAociCurrentPeriodBeforeTaxAttributableToParent": "Amount before tax of reclassification adjustments of other comprehensive income (loss) attributable to parent.",
    "RepaymentsOfLongTermDebt": "The cash outflow for debt initially having maturity due after one year or beyond the normal operating cycle, if longer.",
    "RepaymentsOfOtherShortTermDebt": "Amount of cash outflow for the payment of debt classified as other, maturing within one year or the operating cycle, if longer.",
    "RepaymentsOfShortTermDebtMaturingInMoreThanThreeMonths": "The cash outflow from a repayment of a borrowing having initial term of repayment of more than three months but less than one year or one operating cycle (if the normal cycle is more than one year).",
    "ResearchAndDevelopmentExpense": "The aggregate costs incurred (1) in a planned search or critical investigation aimed at discovery of new knowledge with the hope that such knowledge will be useful in developing a new product or service, a new process or technique, or in bringing about a significant improvement to an existing product or process; or (2) to translate research findings or other knowledge into a plan or design for a new product or process or for a significant improvement to an existing product or process whether intended for sale or the entity's use, during the reporting period charged to research and development projects, including the costs of developing computer software up to the point in time of achieving technological feasibility, and costs allocated in accounting for a business combination to in-process projects deemed to have no alternative future use.",
    "RestrictedCash": "Amount of cash restricted as to withdrawal or usage. Cash includes, but is not limited to, currency on hand, demand deposits with banks or financial institutions, and other accounts with general characteristics of demand deposits.",
    "RestrictedCashAndCashEquivalentsAtCarryingValue": "Amount of cash and cash equivalents restricted as to withdrawal or usage, classified as current. Cash includes, but is not limited to, currency on hand, demand deposits with banks or financial institutions, and other accounts with general characteristics of demand deposits. Cash equivalents include, but are not limited to, short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates.",
    "RestrictedCashAndCashEquivalentsNoncurrent": "Amount of cash and cash equivalents restricted as to withdrawal or usage, classified as noncurrent. Cash includes, but is not limited to, currency on hand, demand deposits with banks or financial institutions, and other accounts with general characteristics of demand deposits. Cash equivalents include, but are not limited to, short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates.",
    "RestrictedInvestments": "Investments which are not defined as or included in marketable (debt, equity, or other) securities whose use is restricted in whole or in part, generally by contractual agreements or regulatory requirements. For use in an unclassified balance sheet.",
    "RetainedEarningsAccumulatedDeficit": "The cumulative amount of the reporting entity's undistributed earnings or deficit.",
    "RevenueFromContractWithCustomerExcludingAssessedTax": "Amount, excluding tax collected from customer, of revenue from satisfaction of performance obligation by transferring promised good or service to customer. Tax collected from customer is tax assessed by governmental authority that is both imposed on and concurrent with specific revenue-producing transaction, including, but not limited to, sales, use, value added and excise.",
    "Revenues": "Amount of revenue recognized from goods sold, services rendered, insurance premiums, or other activities that constitute an earning process. Includes, but is not limited to, investment and interest income before deduction of interest expense when recognized as a component of revenue, and sales and trading gain (loss).",
    "SalesRevenueNet": "Total revenue from sale of goods and services rendered during the reporting period, in the normal course of business, reduced by sales returns and allowances, and sales discounts.",
    "SalesRevenueServicesGross": "Amount before allowances and discounts of service revenue classified as other.",
    "SecuritiesSoldUnderAgreementsToRepurchaseFairValueOfCollateral": "Fair value of securities pledged as collateral against securities sold under agreement to repurchase.",
    "SegmentReportingInformationOperatingIncomeLoss": "Amount of income or loss for the reportable segment before unusual Items, equity method income or loss, income taxes, and extraordinary items.",
    "SegmentReportingReconcilingItemsAssets": "Total of reconciling items between total reportable segments' assets and consolidated entity assets.",
    "SegmentReportingSegmentAssets": "Total assets for reportable segments.",
    "SellingGeneralAndAdministrativeExpense": "The aggregate total costs related to selling a firm's product and services, as well as all other general and administrative expenses. Direct selling expenses (for example, credit, warranty, and advertising) are expenses that can be directly linked to the sale of specific products. Indirect selling expenses are expenses that cannot be directly linked to the sale of specific products, for example telephone expenses, Internet, and postal charges. General and administrative expenses include salaries of non-sales personnel, rent, utilities, communication, etc.",
    "ShareBasedCompensation": "Amount of noncash expense for share-based payment arrangement.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsForfeitedInPeriod": "The number of equity-based payment instruments, excluding stock (or unit) options, that were forfeited during the reporting period.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsForfeitedInPeriodWeightedAverageGrantDateFairValue": "The weighted average fair value as of the grant date of equity-based award plans other than stock (unit) option plans that were not exercised or put into effect during the reporting period as a result of the occurrence of a terminating event specified in the contractual agreement of the plan.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsForfeituresWeightedAverageGrantDateFairValue": "Weighted average fair value as of the grant date of equity-based award plans other than stock (unit) option plans that were not exercised or put into effect as a result of the occurrence of a terminating event.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsGrantsInPeriod": "The number of grants made during the period on other than stock (or unit) option plans (for example, phantom stock or unit plan, stock or unit appreciation rights plan, performance target plan).",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsGrantsInPeriodWeightedAverageGrantDateFairValue": "The weighted average fair value at grant date for nonvested equity-based awards issued during the period on other than stock (or unit) option plans (for example, phantom stock or unit plan, stock or unit appreciation rights plan, performance target plan).",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsNonvestedIntrinsicValue": "Per share or unit weighted-average intrinsic value of nonvested award under share-based payment arrangement. Excludes share and unit options.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsNonvestedNumber": "The number of non-vested equity-based payment instruments, excluding stock (or unit) options, that validly exist and are outstanding as of the balance sheet date.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsNonvestedWeightedAverageGrantDateFairValue": "Per share or unit weighted-average fair value of nonvested award under share-based payment arrangement. Excludes share and unit options.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsVestedInPeriod": "The number of equity-based payment instruments, excluding stock (or unit) options, that vested during the reporting period.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsVestedInPeriodTotalFairValue": "Fair value of share-based awards for which the grantee gained the right by satisfying service and performance requirements, to receive or retain shares or units, other instruments, or cash.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsVestedInPeriodWeightedAverageGrantDateFairValue": "The weighted average fair value as of grant date pertaining to an equity-based award plan other than a stock (or unit) option plan for which the grantee gained the right during the reporting period, by satisfying service and performance requirements, to receive or retain shares or units, other instruments, or cash in accordance with the terms of the arrangement.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardFairValueAssumptionsExpectedDividendRate": "The estimated dividend rate (a percentage of the share price) to be paid (expected dividends) to holders of the underlying shares over the option's term.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardFairValueAssumptionsExpectedTerm": "The period of time an equity-based award is expected to be outstanding. An equity-based award's expected term is generally determined based on, among other factors, the instrument's contractual term and the effects of employees' expected exercise and post-vesting employment termination behavior.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardFairValueAssumptionsRiskFreeInterestRate": "The risk-free interest rate assumption that is used in valuing an option on its own shares.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardFairValueAssumptionsWeightedAverageVolatilityRate": "Rate of weighted-average expected volatility for award under share-based payment arrangement.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardNumberOfSharesAvailableForGrant": "The difference between the maximum number of shares (or other type of equity) authorized for issuance under the plan (including the effects of amendments and adjustments), and the sum of: 1) the number of shares (or other type of equity) already issued upon exercise of options or other equity-based awards under the plan; and 2) shares (or other type of equity) reserved for issuance on granting of outstanding awards, net of cancellations and forfeitures, if applicable.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsExercisableIntrinsicValue": "The total dollar difference between fair values of the underlying shares reserved for issuance and exercise prices of vested portions of options outstanding and currently exercisable under the option plan as of the balance sheet date.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsExercisableNumber": "The number of shares into which fully or partially vested stock options outstanding as of the balance sheet date can be currently converted under the option plan.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsExercisableWeightedAverageExercisePrice": "The weighted-average price as of the balance sheet date at which grantees can acquire the shares reserved for issuance on vested portions of options outstanding and currently exercisable under the stock option plan.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsExercisableWeightedAverageRemainingContractualTerm": "The weighted average period between the balance sheet date and expiration for all vested portions of options outstanding and currently exercisable (or convertible) under the plan, which may be expressed in a decimal value for number of years.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsExercisesInPeriod": "The decrease in the number of reserved shares that could potentially be issued attributable to the exercise or conversion during the reporting period of previously issued stock options under the option plan.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsExercisesInPeriodTotalIntrinsicValue": "Amount of accumulated difference between fair value of underlying shares on dates of exercise and exercise price on options exercised (or share units converted) into shares.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsExercisesInPeriodWeightedAverageExercisePrice": "The weighted average price at which option holders acquired shares when converting their stock options into shares under the plan during the reporting period.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsForfeituresInPeriod": "The number of shares under options that were cancelled during the reporting period as a result of occurrence of a terminating event specified in contractual agreements pertaining to the stock option plan.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsForfeituresInPeriodWeightedAverageExercisePrice": "The weighted average price at which grantees could have acquired the underlying shares with respect to stock options that were terminated during the reporting period due to noncompliance with plan terms during the reporting period.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsGrantsInPeriod": "Net number of share options (or share units) granted during the period.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsGrantsInPeriodWeightedAverageExercisePrice": "The weighted average price as of the balance sheet date at which grantees can acquire the shares reserved for issuance on stock options awarded under the plan during the reporting period.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsGrantsInPeriodWeightedAverageGrantDateFairValue": "The weighted average grant-date fair value of options granted during the reporting period as calculated by applying the disclosed option pricing methodology.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsOtherIncreasesDecreasesInPeriod": "The addition or reduction in the number of reserved shares that could potentially be issued under the option plan attributable to reasons other than grants, exercises, forfeitures, and expirations during the reporting period.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsOutstandingIntrinsicValue": "Amount by which the current fair value of the underlying stock exceeds the exercise price of options outstanding.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsOutstandingNumber": "Number of options outstanding, including both vested and non-vested options.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsOutstandingWeightedAverageExercisePrice": "Weighted average price at which grantees can acquire the shares reserved for issuance under the stock option plan.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsOutstandingWeightedAverageRemainingContractualTerm": "The weighted average period between the balance sheet date and expiration for all awards outstanding under the plan, which may be expressed in a decimal value for number of years.",
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsVestedAndExpectedToVestOutstandingNumber": "Number of fully vested and expected to vest options outstanding that can be converted into shares under option plan. Includes, but is not limited to, unvested options for which requisite service period has not been rendered but that are expected to vest based on achievement of performance condition, if forfeitures are recognized when they occur.",
    "ShareBasedCompensationArrangementsByShareBasedPaymentAwardOptionsExercisesInPeriodWeightedAverageExercisePrice": "Weighted average price at which option holders acquired shares when converting their stock options into shares.",
    "ShareBasedCompensationArrangementsByShareBasedPaymentAwardOptionsForfeituresInPeriodWeightedAverageExercisePrice": "Weighted average price at which grantees could have acquired the underlying shares with respect to stock options that were terminated.",
    "ShareBasedCompensationArrangementsByShareBasedPaymentAwardOptionsGrantsInPeriodWeightedAverageExercisePrice": "Weighted average per share amount at which grantees can acquire shares of common stock by exercise of options.",
    "SharebasedCompensationArrangementBySharebasedPaymentAwardEquityInstrumentsOtherThanOptionsAggregateIntrinsicValueNonvested": "Intrinsic value of nonvested award under share-based payment arrangement. Excludes share and unit options.",
    "SharebasedCompensationArrangementBySharebasedPaymentAwardOptionsExercisableIntrinsicValue1": "Amount of difference between fair value of the underlying shares reserved for issuance and exercise price of vested portions of options outstanding and currently exercisable.",
    "SharebasedCompensationArrangementBySharebasedPaymentAwardOptionsOutstandingWeightedAverageRemainingContractualTerm1": "The weighted average period between the balance sheet date and expiration for all awards outstanding under the plan, which may be expressed in a decimal value for number of years.",
    "SharesPaidForTaxWithholdingForShareBasedCompensation": "Number of shares used to settle grantee's tax withholding obligation for award under share-based payment arrangement.",
    "ShortTermDebtWeightedAverageInterestRate": "Weighted average interest rate of short-term debt outstanding calculated at point in time.",
    "SignificantChangeInUnrecognizedTaxBenefitsIsReasonablyPossibleEstimatedRangeOfChangeLowerBound": "Amount of (increase) decrease reasonably possible in the estimated lower bound of the unrecognized tax benefit for a tax position taken or expected to be taken.",
    "SignificantChangeInUnrecognizedTaxBenefitsIsReasonablyPossibleEstimatedRangeOfChangeUpperBound": "Amount of (increase) decrease reasonably possible in the estimated upper bound of the unrecognized tax benefit for a tax position taken or expected to be taken.",
    "StandardProductWarrantyAccrual": "Amount as of the balance sheet date of the aggregate standard product warranty liability. Does not include the balance for the extended product warranty liability.",
    "StandardProductWarrantyAccrualPayments": "Amount of decrease in the standard product warranty accrual from payments made in cash or in kind to satisfy claims under the terms of the standard product warranty. Excludes extended product warranties.",
    "StandardProductWarrantyAccrualWarrantiesIssued": "Amount of increase in the standard product warranty accrual from warranties issued. Excludes extended product warranties.",
    "StateAndLocalIncomeTaxExpenseBenefitContinuingOperations": "Amount of state and local current and deferred income tax expense (benefit) attributable to continuing operations.",
    "StockholdersEquity": "Total of all stockholders' equity (deficit) items, net of receivables from officers, directors, owners, and affiliates of the entity which are attributable to the parent. The amount of the economic entity's stockholders' equity attributable to the parent excludes the amount of stockholders' equity which is allocable to that ownership interest in subsidiary equity which is not attributable to the parent (noncontrolling interest, minority interest). This excludes temporary equity and is sometimes called permanent equity.",
    "StockholdersEquityNoteStockSplitConversionRatio1": "Ratio applied to the conversion of stock split, for example but not limited to, one share converted to two or two shares converted to one.",
    "StockIssuedDuringPeriodSharesStockOptionsExercised": "Number of share options (or share units) exercised during the current period.",
    "StockIssuedDuringPeriodValueAcquisitions": "Value of stock issued pursuant to acquisitions during the period.",
    "StockIssuedDuringPeriodValueShareBasedCompensation": "Value, after forfeiture, of shares issued under share-based payment arrangement. Excludes employee stock ownership plan (ESOP).",
    "StockRepurchasedAndRetiredDuringPeriodShares": "Number of shares that have been repurchased and retired during the period.",
    "StockRepurchasedAndRetiredDuringPeriodValue": "Equity impact of the value of stock that has been repurchased and retired during the period. The excess of the purchase price over par value can be charged against retained earnings (once the excess is fully allocated to additional paid in capital).",
    "StockRepurchaseProgramAuthorizedAmount": "Amount of a stock repurchase plan authorized by an entity's Board of Directors.",
    "StockRepurchaseProgramAuthorizedAmount1": "Amount of stock repurchase plan authorized.",
    "TaxAdjustmentsSettlementsAndUnusualProvisions": "Amount of increase (decrease) to previously recorded tax expense. Includes, but is not limited to, significant settlements of income tax disputes, and unusual tax positions or infrequent actions taken by the entity, including tax assessment reversal, and IRS tax settlement.",
    "TaxesPayableCurrent": "Carrying value as of the balance sheet date of obligations incurred and payable for statutory income, sales, use, payroll, excise, real, property and other taxes. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer).",
    "TranslationAdjustmentForNetInvestmentHedgeNetOfTax": "Amount, after tax, of cumulative translation adjustment attributable to gain (loss) on foreign currency derivatives that are designated as, and are effective as, economic hedges of a net investment in a foreign entity.",
    "TreasuryStockValueAcquiredCostMethod": "Equity impact of the cost of common and preferred stock that were repurchased during the period. Recorded using the cost method.",
    "UndistributedEarningsOfForeignSubsidiaries": "Amount of undistributed earnings of foreign subsidiaries intended to be permanently reinvested outside the country of domicile.",
    "UnrecognizedTaxBenefits": "Amount of unrecognized tax benefits.",
    "UnrecognizedTaxBenefitsDecreasesResultingFromPriorPeriodTaxPositions": "Amount of decrease in unrecognized tax benefits resulting from tax positions taken in prior period tax returns.",
    "UnrecognizedTaxBenefitsDecreasesResultingFromSettlementsWithTaxingAuthorities": "Amount of decrease in unrecognized tax benefits resulting from settlements with taxing authorities.",
    "UnrecognizedTaxBenefitsIncomeTaxPenaltiesAndInterestAccrued": "Amount accrued for interest on an underpayment of income taxes and penalties related to a tax position claimed or expected to be claimed in the tax return.",
    "UnrecognizedTaxBenefitsIncomeTaxPenaltiesAndInterestExpense": "Amount of expense for interest on an underpayment of income taxes and penalties related to a tax position claimed or expected to be claimed in the tax return.",
    "UnrecognizedTaxBenefitsIncreasesResultingFromCurrentPeriodTaxPositions": "Amount of increase in unrecognized tax benefits resulting from tax positions that have been or will be taken in current period tax return.",
    "UnrecognizedTaxBenefitsIncreasesResultingFromPriorPeriodTaxPositions": "Amount of increase in unrecognized tax benefits resulting from tax positions taken in prior period tax returns.",
    "UnrecognizedTaxBenefitsPeriodIncreaseDecrease": "Amount of increase (decrease) in unrecognized tax benefits attributable to uncertain tax positions taken in tax returns.",
    "UnrecognizedTaxBenefitsReductionsResultingFromLapseOfApplicableStatuteOfLimitations": "Amount of decrease in unrecognized tax benefits resulting from lapses of applicable statutes of limitations.",
    "UnrecognizedTaxBenefitsThatWouldImpactEffectiveTaxRate": "The total amount of unrecognized tax benefits that, if recognized, would affect the effective tax rate.",
    "UnrecordedUnconditionalPurchaseObligationBalanceOnFifthAnniversary": "Amount of fixed and determinable portion of unrecorded unconditional purchase obligation to be paid in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "UnrecordedUnconditionalPurchaseObligationBalanceOnFirstAnniversary": "Amount of fixed and determinable portion of unrecorded unconditional purchase obligation to be paid in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "UnrecordedUnconditionalPurchaseObligationBalanceOnFourthAnniversary": "Amount of fixed and determinable portion of unrecorded unconditional purchase obligation to be paid in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "UnrecordedUnconditionalPurchaseObligationBalanceOnSecondAnniversary": "Amount of fixed and determinable portion of unrecorded unconditional purchase obligation to be paid in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "UnrecordedUnconditionalPurchaseObligationBalanceOnThirdAnniversary": "Amount of fixed and determinable portion of unrecorded unconditional purchase obligation to be paid in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "UnrecordedUnconditionalPurchaseObligationBalanceSheetAmount": "Amount of the unrecorded obligation to transfer funds in the future for fixed or minimum amounts or quantities of goods or services at fixed or minimum prices (for example, as in take-or-pay contracts or throughput contracts).",
    "UnrecordedUnconditionalPurchaseObligationDueAfterFiveYears": "Amount of fixed and determinable portion of unrecorded unconditional purchase obligation to be paid after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach).",
    "VariableLeaseCost": "Amount of variable lease cost, excluded from lease liability, recognized when obligation for payment is incurred for finance and operating leases.",
    "WeightedAverageNumberDilutedSharesOutstandingAdjustment": "The sum of dilutive potential common shares or units used in the calculation of the diluted per-share or per-unit computation.",
    "WeightedAverageNumberOfDilutedSharesOutstanding": "The average number of shares or units issued and outstanding that are used in calculating diluted EPS or earnings per unit (EPU), determined based on the timing of issuance of shares or units in the period.",
    "WeightedAverageNumberOfSharesOutstandingBasic": "Number of [basic] shares or units, after adjustment for contingently issuable shares or units and other shares or units not deemed outstanding, determined by relating the portion of time within a reporting period that common shares or units have been outstanding to the total time in that period.",
    "DeferredTaxAssetsOtherComprehensiveLoss": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from unrealized losses in other comprehensive income.",
    "EffectiveIncomeTaxRateReconciliationFdiiAmount": null,
    "DebtSecuritiesAvailableForSaleRestricted": "Amount of restricted investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale).",
    "InventoryWorkInProcessAndRawMaterialsNetOfReserves": "The aggregate carrying amount, net of valuation reserves and adjustments, as of the balance sheet date of items which are partially completed at the time of measurement and unprocessed items that will go through the production process and become part of the final product. This element may be used when the reporting entity combines work in process and raw materials into an aggregate amount.",
    "UnrecordedUnconditionalPurchaseObligationDueInRemainderOfFiscalYear": "Amount of fixed and determinable portion of unrecorded unconditional purchase obligation to be paid in remainder of current fiscal year.",
    "InventoryRawMaterialsAndPurchasedPartsNetOfReserves": "Carrying amount, net of valuation reserves and adjustments, as of the balance sheet date of items purchased for use as components of a finished product or pieces of machinery and equipment plus any items in their natural and unrefined state. This element may be used when the reporting entity combines raw materials and purchased parts into an aggregate amount.",
    "HedgedAssetFairValueHedge": "Amount of asset hedged in fair value hedging relationship.",
    "HedgedLiabilityFairValueHedge": "Amount of liability hedged in fair value hedging relationship.",
    "DeferredIncomeTaxAssetsNet": "Amount, after allocation of valuation allowances and deferred tax liability, of deferred tax asset attributable to deductible differences and carryforwards, with jurisdictional netting.",
    "DeferredTaxLiabilitiesPropertyPlantAndEquipment": "Amount of deferred tax liability attributable to taxable temporary differences from property, plant, and equipment.",
    "IncrementalCommonSharesAttributableToShareBasedPaymentArrangements": "Additional shares included in the calculation of diluted EPS as a result of the potentially dilutive effect of share based payment arrangements using the treasury stock method.",
    "OtherAssetsMiscellaneousNoncurrent": "Amount of other miscellaneous assets expected to be realized or consumed after one year or normal operating cycle, if longer."
}